#!/bin/sh

###################################################################################################
####                           公共方法
####
####
####
####################################################################################################
####################################带时间的日志信息####################################################################
. /etc/profile


ssh marcpoint@172.16.1.145 'sh /home/marcpoint/test/test.sh'

echo "place input the num(1-10):"
read num

while [[ "$num" != 4 ]];
do
    if [ "$num" -lt 4 ]; then
        echo "Too small. Try again!"
        read num

    elif [ "$num" -gt 4 ]; then
        echo "To high. Try again"
        read num

    else
        exit 0
    fi
done
echo "Congratulation, you are rigth!"


##################################### 测试 后台运行 ###################################################



